In [16]:
import numpy as np
import pandas as pd
import xlwings as xw

import sys
from functools import reduce
pd.set_option('display.max_columns', None) 
pd.set_option('display.max_rows', None)

### connecting with excel file using xlwings

In [14]:
rough1=pd.read_excel('rough.xlsx', sheet_name='Sheet1')
rough2=pd.read_excel('rough.xlsx', sheet_name='Sheet2')
wb=xw.Book(r'D:\sujit_learn\rough.xlsx')
xl_rough1=wb.sheets['Sheet1']
xl_rough2=wb.sheets['Sheet2']
rough1.head()
rough2.head()

  status1            status2   flag
0    paid               paid   True
1    paid                NaN   True
2      os  ready for payment   True
3     rej                NaN  False
4    paid                NaN   True

In [13]:
status1_mask=rough2['status1'].str.lower()=='paid'
s2_filter=['ready for payment','pending for payment']
status2_mask=rough2['status2'].str.lower().isin(s2_filter)

status1_mask
status2_mask

rough2[(status1_mask) | (status2_mask)]

  status1              status2
0    paid                 paid
1    paid                  NaN
2      os    ready for payment
4    paid                  NaN
5      os  Pending for Payment

In [ ]:

rough1.drop_duplicates(inplace=True)
rough1
xl_rough1.range('B1').options(pd.DataFrame, index=False).value=rough1
wb.save()

In [17]:
flag=[True,False,True]
z=reduce(lambda x,y:x*y, flag)
z

0

In [ ]:
points_list=['varPBIB varComments','icr_pt1','icr_pt2','icr_pt3', 'demography_pt1', 'demography_pt2','claim_type_pt1','po_pt1','hvc_pt1', 'disease_pt1', 'disease_pt2', 'disease_pt3']

In [18]:
a=[1,2,3,4]
for i in range(1,len(a)):
    print(i)

1
2
3

In [26]:
l=['abc','def','xyz','xab']
for i in l:
    if 'x' in i:
        l.remove(i)
print(l)

['abc', 'def', 'xab']

In [ ]:
a=1
b=2

### ways to replace values of a columns in pandas

In [ ]:
import pandas as pd
import numpy as np

Student = {
    'Name': ['John', 'Jay', 'Sachin', 'Geetha', 'Amutha', 'Ganesh'],
    'gender': ['male', 'male', 'male', 'female', 'female', 'male'],
    'math score': [50, 100, 70, 80, 75, 40],
    'test preparation': ['none', 'completed', 'none', 'completed', 'completed', 'none'],
}

df = pd.DataFrame(Student)
df.loc[df['gender'] == 'male', 'gender'] = 1
print(df)

#using np.where
df['gender'] = np.where(df['gender'] == 'female', 0, 1)

#using .replace
# For example, to replace “ABC” and “AB” with “A” in the “BrandName” column:
df['BrandName'].replace(['ABC', 'AB'], 'A', inplace=True)

## Converting data-types

In [ ]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
   'A': ['1', '2', '3'],
   'B': ['4', '5', '6'],
   'C': ['7', '8', '9']
})

print("Original DataFrame")
print(df.dtypes)
print(df)

# Convert data types
df['A'] = df['A'].astype(int)
df['B'] = df['B'].astype('int16')
df['B'] = df['B'].astype(float)
df['C'] = df['C'].astype('float64')
df['C'] = df['C'].astype('category')

print("\nDataFrame after type conversion")
print(df.dtypes)
print(df)

In [ ]:
'''
-------int------------

In Python and pandas, there are several integer data types you can convert to, each with different ranges of values they can represent:

int8: It can hold integer values from -128 to 127. It uses 8 bits of memory.
int16: It can hold integer values from -32,768 to 32,767. It uses 16 bits of memory.
int32: It can hold integer values from -2,147,483,648 to 2,147,483,647. It uses 32 bits of memory.
int64: It can hold integer values from -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807. It uses 64 bits of memory.

You can convert a pandas DataFrame column to one of these types using the astype() function

-------float------------
In Python and pandas, there are several floating-point data types you can convert to, each with different levels of precision:

float16 or Half precision: It uses 16 bits of memory. It has a precision of 3.3 decimal digits.
float32 or Single precision: It uses 32 bits of memory. It has a precision of about 7.2 decimal digits.
float64 or Double precision: It uses 64 bits of memory. It has a precision of about 15.9 decimal digits.
'''

In [ ]:
# to count the number of innings in which VK scored between 51 and 99.(both 51 and 99 are included.)
vk[vk.between(51,99)].size

# .isin--
vk[vk.isin([49,99])]    # vk.between(49,99) select all rows between 49,99 including 49 & 99.
vk[(vk == 49) | (vk == 99)] # alt syntex

subs.clip(100,200)
# 100 se kam waali will be raised to 100, and 200 se jayda waali values will be lowered to 200. so size will remain same.

# to rename column
students.rename(columns={'marks':'percent','package':'lpa'},inplace=True)

## rough

In [16]:
import pandas as pd

mi=pd.MultiIndex.from_product([['cse','me'],[2019,2020,2021,2022]])
print(type(mi))
mi.levels

<class 'pandas.core.indexes.multi.MultiIndex'>

FrozenList([['cse', 'me'], [2019, 2020, 2021, 2022]])

In [18]:
df1 = pd.DataFrame(
    [
        [1,2],
        [3,4],
        [5,6],
        [7,8],
        [9,10],
        [11,12],
        [13,14],
        [15,16],
    ],
    index = mi,
    columns = ['avg_package','students']
)

df1['students']

cse  2019     2
     2020     4
     2021     6
     2022     8
me   2019    10
     2020    12
     2021    14
     2022    16
Name: students, dtype: int64

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [20]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [39]:
pd.pivot_table(df, index='sex', columns='smoker', values=['tip'],aggfunc=['count','sum'], margins=True)

       count               sum
         tip               tip
smoker   Yes   No  All     Yes      No     All
sex
Male      60   97  157  183.07  302.00  485.07
Female    33   54   87   96.74  149.77  246.51
All       93  151  244  279.81  451.77  731.58

In [62]:
import datetime as dt
import numpy as np

In [78]:
x=pd.Timestamp('19 2 2024')
x

Timestamp('2024-02-19 00:00:00')

In [75]:
s = pd.Series(['2023/1/1','2022/1/1','2021/1/1'])
pd.to_datetime(s)

0   2023-01-01
1   2022-01-01
2   2021-01-01
dtype: datetime64[ns]

In [72]:
d=np.array('2015-07-03', dtype=np.datetime64)
d+np.arange(5)

array(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
       '2015-07-07'], dtype='datetime64[D]')

In [ ]:
pd.merge(students, regs, how='inner', on = 'student_id')

In [21]:
df=sns.load_dataset('tips')
print(df.shape)
df.head()
# df.shape
# df.columns

(244, 7)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [48]:
df.groupby('sex').agg([min,'count'])

       total_bill        tip       size
              min count  min count  min count
sex
Male         7.25   157  1.0   157    1   157
Female       3.07    87  1.0    87    1    87

In [35]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [44]:
df.groupby('day')['total_bill'].max().sort_values(ascending=False)
df.groupby('sex').get_group('Male')

     total_bill   tip   sex smoker  day    time  size
1         10.34  1.66  Male     No  Sun  Dinner     3
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68  3.31  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
6          8.77  2.00  Male     No  Sun  Dinner     2
..          ...   ...   ...    ...  ...     ...   ...
236       12.60  1.00  Male    Yes  Sat  Dinner     2
237       32.83  1.17  Male    Yes  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3
241       22.67  2.00  Male    Yes  Sat  Dinner     2
242       17.82  1.75  Male     No  Sat  Dinner     2

[157 rows x 7 columns]

In [ ]:
# len()
# .size()
# .get_group('name')
# .groups.keys()
# .sample(2, replace=True)
# .first()
# .last()
# .nth(6)

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']